{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[MASK]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[PAD]": 4,
      "\"": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      ":": 17,
      "=": 18,
      "A": 19,
      "H": 20,
      "I": 21,
      "T": 22,
      "W": 23,
      "_": 24,
      "a": 25,
      "b": 26,
      "c": 27,
      "d": 28,
      "e": 29,
      "f": 30,
      "g": 31,
      "h": 32,
      "i": 33,
      "k": 34,
      "l": 35,
      "m": 36,
      "n": 37,
      "o": 38,
      "p": 39,
      "r": 40,
      "s": 41,
      "t": 42,
      "u": 43,
      "v": 44,
      "w": 45,
      "x": 46,
      "y": 47,
      "on": 48,
      "er": 49,
      "in": 50,
      "th": 51,
      "nu": 52,
      "num": 53,
      "):": 54,
      "ar": 55,
      "de": 56,
      "ion": 57,
      "pr": 58,
      "un": 59,
      "er_": 60,
      "the": 61,
      "_s": 62,
      "an": 63,
      "ct": 64,
      "es": 65,
      "ex": 66,
      "fun": 67,
      "if": 68,
      "is": 69,
      "lon": 70,
      "or": 71,
      "ou": 72,
      "per_": 73,
      "rg": 74,
      "uper_": 75,
      "you": 76,
      "ing": 77,
      "int": 78,
      "def": 79,
      "print": 80,
      "ction": 81,
      "function": 82,
      "long": 83,
      "uper_long": 84,
      "\",": 85,
      "(\"": 86,
      "():": 87,
      "An": 88,
      "He": 89,
      "Tr": 90,
      "Wor": 91,
      "_n": 92,
      "_t": 93,
      "_v": 94,
      "_ex": 95,
      "am": 96,
      "ay": 97,
      "ath": 98,
      "ber": 99,
      "ban": 100,
      "brg": 101,
      "crg": 102,
      "dar": 103,
      "dif": 104,
      "ee": 105,
      "en": 106,
      "e_t": 107,
      "fer": 108,
      "hi": 109,
      "im": 110,
      "ide": 111,
      "ld": 112,
      "le": 113,
      "ll": 114,
      "lay": 115,
      "mo": 116,
      "my": 117,
      "math": 118,
      "of": 119,
      "oth": 120,
      "por": 121,
      "play": 122,
      "re": 123,
      "ring": 124,
      "sy": 125,
      "sion": 126,
      "super_long": 127,
      "see": 128,
      "side": 129,
      "tun": 130,
      "tring": 131,
      "ue": 132,
      "whi": 133,
      "number": 134,
      "arg": 135,
      "ar_n": 136,
      "pres": 137,
      "er_function": 138,
      "_super_long": 139,
      "_string": 140,
      "anoth": 141,
      "ext": 142,
      "And": 143,
      "Hell": 144,
      "True": 145,
      "World": 146,
      "_var_n": 147,
      "_expres": 148,
      "ame_t": 149,
      "band": 150,
      "dark": 151,
      "differ": 152,
      "ent": 153,
      "impor": 154,
      "moon": 155,
      "my_super_long": 156,
      "math_expres": 157,
      "playing": 158,
      "sys": 159,
      "super_long_string": 160,
      "tunes": 161,
      "while": 162,
      "another_function": 163,
      "Hello": 164,
      "_var_name_t": 165,
      "different": 166,
      "import": 167,
      "my_super_long_var_name_t": 168,
      "math_expression": 169,
      "my_super_long_var_name_text": 170
    },
    "merges": [
      "o n",
      "e r",
      "i n",
      "t h",
      "n u",
      "nu m",
      ") :",
      "a r",
      "d e",
      "i on",
      "p r",
      "u n",
      "er _",
      "th e",
      "_ s",
      "a n",
      "c t",
      "e s",
      "e x",
      "f un",
      "i f",
      "i s",
      "l on",
      "o r",
      "o u",
      "p er_",
      "r g",
      "u per_",
      "y ou",
      "in g",
      "in t",
      "de f",
      "pr int",
      "ct ion",
      "fun ction",
      "lon g",
      "uper_ long",
      "\" ,",
      "( \"",
      "( ):",
      "A n",
      "H e",
      "T r",
      "W or",
      "_ n",
      "_ t",
      "_ v",
      "_ ex",
      "a m",
      "a y",
      "a th",
      "b er",
      "b an",
      "b rg",
      "c rg",
      "d ar",
      "d if",
      "e e",
      "e n",
      "e _t",
      "f er",
      "h i",
      "i m",
      "i de",
      "l d",
      "l e",
      "l l",
      "l ay",
      "m o",
      "m y",
      "m ath",
      "o f",
      "o th",
      "p or",
      "p lay",
      "r e",
      "r ing",
      "s y",
      "s ion",
      "s uper_long",
      "s ee",
      "s ide",
      "t un",
      "t ring",
      "u e",
      "w hi",
      "num ber",
      "ar g",
      "ar _n",
      "pr es",
      "er_ function",
      "_s uper_long",
      "_s tring",
      "an oth",
      "ex t",
      "An d",
      "He ll",
      "Tr ue",
      "Wor ld",
      "_v ar_n",
      "_ex pres",
      "am e_t",
      "ban d",
      "dar k",
      "dif fer",
      "en t",
      "im por",
      "mo on",
      "my _super_long",
      "math _expres",
      "play ing",
      "sy s",
      "super_long _string",
      "tun es",
      "whi le",
      "anoth er_function",
      "Hell o",
      "_var_n ame_t",
      "differ ent",
      "impor t",
      "my_super_long _var_name_t",
      "math_expres sion",
      "my_super_long_var_name_t ext"
    ]
  }
}